{
    "container_type": "Author",
    "filled": [
        "basics",
        "publications",
        "indices",
        "counts"
    ],
    "scholar_id": "G7dzNUkAAAAJ",
    "source": "AUTHOR_PROFILE_PAGE",
    "name": "Xiaotian Dai",
    "url_picture": "https://scholar.googleusercontent.com/citations?view_op=view_photo&user=G7dzNUkAAAAJ&citpid=17",
    "affiliation": "Real-Time Systems Group (RTSRG), University of York",
    "organization": 8709644777412073106,
    "interests": [
        "Real-Time Systems",
        "Scheduling",
        "Cyber-Physical Systems",
        "Robotics and Autonomous Systems"
    ],
    "email_domain": "@york.ac.uk",
    "homepage": "https://www.xiaotiandai.com/",
    "citedby": 536,
    "publications": [
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Model based system assurance using the structured assurance case metamodel",
                "pub_year": 2019,
                "citation": "Journal of Systems and Software 154, 211-233, 2019",
                "author": "Ran Wei and Tim P Kelly and Xiaotian Dai and Shuai Zhao and Richard Hawkins",
                "journal": "Journal of Systems and Software",
                "volume": "154",
                "pages": "211-233",
                "publisher": "Elsevier",
                "abstract": "Assurance cases are used to demonstrate confidence in system properties of interest (e.g. safety and/or security). A number of system assurance approaches are adopted by industries in the safety-critical domain. However, the task of constructing assurance cases remains a manual, lenghty and informal process. The Structured Assurance Case Metamodel (SACM) is a standard specified by the Object Management Group (OMG). SACM provides a richer set of features than existing system assurance languages/approaches. SACM provides a foundation for model-based system assurance, which bears great application potentials in growing technology domains such as Open Adaptive Systems. However, the intended usage of SACM has not been sufficiently explained. In addition, there has not been support to interoperate between existing assurance case (models) and SACM models.In this article, we explain the …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:_kc_bZDykSQC",
            "num_citations": 91,
            "citedby_url": "/scholar?hl=en&cites=5019954335403981056",
            "cites_id": [
                "5019954335403981056"
            ],
            "pub_url": "https://www.sciencedirect.com/science/article/pii/S0164121219301062",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:ALlvBt91qkUJ:scholar.google.com/",
            "cites_per_year": {
                "2019": 7,
                "2020": 15,
                "2021": 16,
                "2022": 12,
                "2023": 12,
                "2024": 21,
                "2025": 8
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "DAG Scheduling and Analysis on Multiprocessor Systems: Exploitation of Parallelism and Dependency",
                "pub_year": 2020,
                "citation": "IEEE Real-Time Systems Symposium (RTSS), 2020",
                "author": "Shuai Zhao and Xiaotian Dai and Iain Bate and Alan Burns and Wanli Chang",
                "conference": "IEEE Real-Time Systems Symposium (RTSS)",
                "publisher": "IEEE",
                "abstract": "With ever more complex functionalities being implemented in emerging real-time applications, multiprocessor systems are demanded for high performance, and directed acyclic graphs (DAGs) are used to model functional dependencies. In this work, we study a single periodic non-preemptive DAG running on a homogeneous multiprocessor platform, which is a common setup in many domains, such as automotive, robotics, and industrial automation. Aiming to reduce the makespan of the DAG and provide a tight yet safe bound, our contributions involve the exploitation of node-level parallelism and inter-node dependency, which are the two key factors of a DAG topology. First, we introduce a concurrent provider and consumer (CPC) model that precisely captures the above two factors, and can be recursively applied when parsing a DAG. Building upon CPC, we propose a novel scheduling method focused on …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:-f6ydRqryjwC",
            "num_citations": 80,
            "citedby_url": "/scholar?hl=en&cites=17932338192299469238",
            "cites_id": [
                "17932338192299469238"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9355569/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:tikuiJN23PgJ:scholar.google.com/",
            "cites_per_year": {
                "2021": 6,
                "2022": 13,
                "2023": 24,
                "2024": 16,
                "2025": 20
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "DAG scheduling and analysis on multi-core systems by modelling parallelism and dependency",
                "pub_year": 2022,
                "citation": "IEEE Transactions on Parallel and Distributed Systems 33 (12), 4019-4038, 2022",
                "author": "Shuai Zhao and Xiaotian Dai and Iain Bate",
                "journal": "IEEE Transactions on Parallel and Distributed Systems",
                "volume": "33",
                "number": "12",
                "pages": "4019-4038",
                "publisher": "IEEE",
                "abstract": "With ever more complex functionalities being implemented in emerging real-time applications, multi-core systems are demanded for high performance, with directed acyclic graphs (DAG) being used to model functional dependencies. For a single DAG task, our previous work presented a concurrent provider and consumer (CPC) model that captures the node-level dependency and parallelism, which are the two key factors of a DAG. Based on the CPC, scheduling and analysis methods were constructed to reduce makespan and tighten the analytical bound of the task. However, the CPC-based methods cannot support multi-DAGs as the interference between DAGs (i.e., inter-task interference) is not taken into account. To address this limitation, this article proposes a novel multi-DAG scheduling approach which specifies the number of cores a DAG can utilise so that it does not incur the inter-task interference. This is …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:NaGl4SEjCO4C",
            "num_citations": 47,
            "citedby_url": "/scholar?hl=en&cites=11459346700640039032",
            "cites_id": [
                "11459346700640039032"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9779935/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:eLCxKRzHB58J:scholar.google.com/",
            "cites_per_year": {
                "2022": 1,
                "2023": 10,
                "2024": 14,
                "2025": 22
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "All in one network for driver attention monitoring",
                "pub_year": 2020,
                "citation": "IEEE International Conference on Acoustics, Speech and Signal Processing …, 2020",
                "author": "Dawei Yang and Xinlei Li and Xiaotian Dai and Rui Zhang and Lizhe Qi and Wenqiang Zhang and Zhe Jiang",
                "conference": "IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)",
                "pages": "2258-2262",
                "publisher": "IEEE",
                "abstract": "Nowadays, driver drowsiness and driver distraction is considered as a major risk for fatal road accidents around the world. As a result, driver monitoring identifying is emerging as an essential function of automotive safety systems. Its basic features include head pose, gaze direction, yawning and eye state analysis. However, existing work has investigated algorithms to detect these tasks separately and was usually conducted under laboratory environments. To address this problem, we propose a multi-task learning CNN framework which simultaneously solve these tasks. The network is implemented by sharing common features and parameters of highly related tasks. Moreover, we propose Dual-Loss Block to decompose the pose estimation task into pose classification and coarse-to-fine regression and Objectcentric Aware Block to reduce orientation estimation errors. Thus, with such novel designs, our model not …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:dhFuZR0502QC",
            "num_citations": 46,
            "citedby_url": "/scholar?hl=en&cites=4600189281173055659",
            "cites_id": [
                "4600189281173055659"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9053659/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:qyjhQ8cn1z8J:scholar.google.com/",
            "cites_per_year": {
                "2020": 5,
                "2021": 8,
                "2022": 8,
                "2023": 6,
                "2024": 13,
                "2025": 4
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Period adaptation of real-time control tasks with fixed-priority scheduling in cyber-physical systems",
                "pub_year": 2020,
                "citation": "Journal of Systems Architecture (JSA) 103, 101691, 2020",
                "author": "Xiaotian Dai and Alan Burns",
                "journal": "Journal of Systems Architecture (JSA)",
                "volume": "103",
                "pages": "101691",
                "publisher": "North-Holland",
                "abstract": "Long-lived, non-stop cyber-physical systems (CPS) are subject to evolutionary changes that can undermine the guarantees of schedulability that were verified at the time of deployment. At the same time, knowledge gleamed from extended periods of execution can be exploited to reduce the uncertainties that were inevitably presented in the system models that are used to define the temporal behaviours of the control tasks. In this paper we utilise this knowledge and present an adaptation method that actively extends the period of control tasks at run-time based on historical measurements. This can lead to lower power consumption or to the accommodation of increased computation resource demands from other components of the CPS. The method relies on online monitoring and model-based prediction to degrade control performance while having a minimal and acceptable impact on ongoing operations. Cloud …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:Wp0gIr-vW9MC",
            "num_citations": 41,
            "citedby_url": "/scholar?hl=en&cites=16806345422517371812",
            "cites_id": [
                "16806345422517371812"
            ],
            "pub_url": "https://www.sciencedirect.com/science/article/pii/S1383762119304989",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:pAOpMR4iPOkJ:scholar.google.com/",
            "cites_per_year": {
                "2020": 3,
                "2021": 8,
                "2022": 9,
                "2023": 6,
                "2024": 10,
                "2025": 5
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Fixed-priority scheduling and controller co-design for time-sensitive networks",
                "pub_year": 2020,
                "citation": "Proceedings of the 39th International Conference on Computer-Aided Design, 1-9, 2020",
                "author": "Xiaotian Dai and Shuai Zhao and Yu Jiang and Xun Jiao and Xiaobo Sharon Hu and Wanli Chang",
                "pages": "1-9",
                "abstract": "Time-sensitive networking (TSN) is a set of standardised communication protocols developed under the IEEE 802.1 working group. TSN aims to support deterministic communication based on network schedules that are distributively configured. It is widely considered as the future in-vehicle network solution for highly automated driving, where the requirement on timing guarantee is alongside the demand of high communication bandwidth. In this work, we study a setting of periodic control and non-control packets, with implicit and arbitrary deadlines, respectively. As the FIFO (first-in, first-out) queues in the 802.1Qbv switch incur long delay in the worst case, which prevents the control tasks from achieving short sampling periods and thus impedes control performance optimisation, we propose the first fixed-priority scheduling (FPS) approach for TSN by leveraging its gate control features. In this context, we develop a …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:IWHjjKOFINEC",
            "num_citations": 38,
            "citedby_url": "/scholar?hl=en&cites=2805306555151411629",
            "cites_id": [
                "2805306555151411629"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3400302.3415715",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:renf4XJz7iYJ:scholar.google.com/",
            "cites_per_year": {
                "2021": 7,
                "2022": 7,
                "2023": 6,
                "2024": 10,
                "2025": 8
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "MCS-IOV: Real-time I/O virtualization for mixed-criticality systems",
                "pub_year": 2019,
                "citation": "IEEE Real-Time Systems Symposium (RTSS), 326-338, 2019",
                "author": "Zhe Jiang and Neil Audsley and Pan Dong and Nan Guan and Xiaotian Dai and Lifeng Wei",
                "conference": "IEEE Real-Time Systems Symposium (RTSS)",
                "pages": "326-338",
                "publisher": "IEEE",
                "abstract": "In mixed-criticality systems, timely handling of I/O is a key for the system being successfully implemented and functioning appropriately. The criticality levels of functions and sometimes the whole system are often dependent on the state of the I/O. An I/O system for a MCS must provide simultaneously isolation/separation, performance/efficiency and timing-predictability, as well as being able to manage I/O resource in an adaptive manner to facilitate efficient yet safe resource sharing among components of different criticality levels. Existing approaches cannot achieve all of these requirements simultaneously. This paper presents a MCS I/O management framework, termed MCS-IOV. MCS-IOV is based on hardware assisted virtualisation, which provides temporal and spatial isolation and prohibits fault propagation with small extra overhead in performance. MCS-IOV extends a real-time I/O virtualisation system, by …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:7PzlFSSx8tAC",
            "num_citations": 31,
            "citedby_url": "/scholar?hl=en&cites=2982102973901162152",
            "cites_id": [
                "2982102973901162152"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9052193/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:qMYD29qOYikJ:scholar.google.com/",
            "cites_per_year": {
                "2019": 1,
                "2020": 5,
                "2021": 7,
                "2022": 4,
                "2023": 3,
                "2024": 6,
                "2025": 5
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "A dual-mode strategy for performance-maximisation and resource-efficient CPS design",
                "pub_year": 2019,
                "citation": "ACM Transactions on Embedded Computing Systems (TECS) 18 (5s), 1-20, 2019",
                "author": "Xiaotian Dai and Wanli Chang and Shuai Zhao and Alan Burns",
                "journal": "ACM Transactions on Embedded Computing Systems (TECS)",
                "volume": "18",
                "number": "5s",
                "pages": "1-20",
                "publisher": "ACM",
                "abstract": "The emerging scenarios of cyber-physical systems (CPS), such as autonomous vehicles, require implementing complex functionality with limited resources, as well as high performances. This paper considers a common setup in which multiple control and non-control tasks share one processor, and proposes a dual-mode strategy. The control task switches between two sampling periods when rejecting (coping with) a disturbance. We create an optimisation framework looking for the switching sampling periods and time instants that maximise the control performance (indexed by settling time) and resource efficiency (indexed by the number of tasks that are schedulable on the processor). The latter objective is enabled with schedulability analysis tailored for the dual-mode model. Experimental results show that (i) given a set of tasks, the proposed strategy improves the control performances whilst retaining …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:aqlVkmm33-oC",
            "num_citations": 26,
            "citedby_url": "/scholar?hl=en&cites=1669016992132392378",
            "cites_id": [
                "1669016992132392378"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3358213",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:umUkjByKKRcJ:scholar.google.com/",
            "cites_per_year": {
                "2019": 1,
                "2020": 8,
                "2021": 4,
                "2022": 5,
                "2023": 7,
                "2024": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "reTSN: Resilient and Efficient Time-Sensitive Network for Automotive In-Vehicle Communication",
                "pub_year": 2022,
                "citation": "IEEE Transactions on Computer Aided Design of Integrated Circuits & Systems, 2022",
                "author": "Jie Zou and Xiaotian Dai and John A McDermid",
                "journal": "IEEE Transactions on Computer Aided Design of Integrated Circuits & Systems",
                "abstract": "Time-sensitive networking (TSN) is being widely investigated to provide Ethernet capabilities for in-vehicle backbone communication. However, the gate control list (GCL), as a simple mechanism for achieving timing determinism for safety-critical traffic (ST) frames with hard deadlines, is too rigid to handle the intrinsic timing uncertainty of automated driving systems (ADSs). Due to the complexity and the unpredictable operating environment, there can be delayed ST frames that can disrupt the solidly fixed timing behavior. In this work, we present one novel approach to effectively use bandwidth resources to deal with delayed ST frames, which cannot be handled by a traditional fixed GCL, and the discarding of them should be reduced to improve the system’s integrity. An acceptance test is implemented to report to the application layer when an ST frame will miss its deadline and hence be rejected, i.e., prevented from …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:RYcK_YlVTxYC",
            "num_citations": 23,
            "citedby_url": "/scholar?hl=en&cites=13438275580736166425",
            "cites_id": [
                "13438275580736166425"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9826899/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:GdqVD3FYfroJ:scholar.google.com/",
            "cites_per_year": {
                "2023": 2,
                "2024": 11,
                "2025": 8
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Toward an analysable, scalable, energy-efficient I/O virtualization for mixed-criticality systems",
                "pub_year": 2021,
                "citation": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and …, 2021",
                "author": "Zhe Jiang and Xiaotian Dai and Pan Dong and Ran Wei and Dawei Yang and Neil C Audsley and Nan Guan",
                "journal": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
                "volume": "41",
                "number": "2",
                "pages": "320-333",
                "publisher": "IEEE",
                "abstract": "In mixed-criticality systems (MCSs), timely handling of I/O operations is a key for the system being successfully implemented and appropriately functioned. The I/O system for an MCS must simultaneously enable different features, including isolation/separation, timing-predictability, performance, scalability, and energy-efficiency. Moreover, such an I/O system also requires to manage I/O resource in an adaptive manner to facilitate efficient yet safe resource sharing among components of different criticality levels. Existing approaches cannot achieve all of these requirements simultaneously. This article presents a mixed-criticality I/O management framework, termed MCS-IOV. MCS-IOV is based on hardware-assisted virtualization, which provides temporal and spatial isolation and prohibits fault propagation with limited extra overhead. MCS-IOV extends a real-time I/O virtualization system, by supporting the concept of …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:r0BpntZqJG4C",
            "num_citations": 17,
            "citedby_url": "/scholar?hl=en&cites=14400333692217807331",
            "cites_id": [
                "14400333692217807331"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9354856/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:41G7YzJD2McJ:scholar.google.com/",
            "cites_per_year": {
                "2021": 3,
                "2022": 6,
                "2023": 1,
                "2024": 4,
                "2025": 3
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Timing-accurate general-purpose I/O for multi-and many-core systems: Scheduling and hardware support",
                "pub_year": 2020,
                "citation": "2020 57th ACM/IEEE Design Automation Conference (DAC), 1-6, 2020",
                "author": "Shuai Zhao and Zhe Jiang and Xiaotian Dai and Iain Bate and Ibrahim Habli and Wanli Chang",
                "conference": "2020 57th ACM/IEEE Design Automation Conference (DAC)",
                "pages": "1-6",
                "publisher": "IEEE",
                "abstract": "General-purpose I/O widely exists on multi- and many-core systems. For real-time applications, I/O operations are often required to be timing-predictable, i.e., bounded in the worst case, and timing-accurate, i.e., occur at (or near) an exact desired time instant. Unfortunately, both timing requirements of I/O operations are hard to achieve from the system level, especially for many-core architectures, due to various latency and contention factors presented in the path of instigating an I/O request. This paper considers a dedicated I/O co-processing unit, and proposes two scheduling methods, with the necessary hardware support implemented. It is the first work that guarantees timing predictability and maximises timing accuracy of I/O tasks in the multi-and many-core systems."
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:QIV2ME_5wuYC",
            "num_citations": 14,
            "citedby_url": "/scholar?hl=en&cites=2719180929399510783",
            "cites_id": [
                "2719180929399510783"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9218686/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:_9bfAKZ4vCUJ:scholar.google.com/",
            "cites_per_year": {
                "2021": 2,
                "2022": 3,
                "2023": 4,
                "2024": 5
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "HIART-MCS: High Resilience and Approximated Computing Architecture for Imprecise Mixed-Criticality Systems",
                "pub_year": 2021,
                "citation": "IEEE Real-Time Systems Symposium (RTSS), 290-303, 2021",
                "author": "Zhe Jiang and Xiaotian Dai and Neil Audsley",
                "conference": "IEEE Real-Time Systems Symposium (RTSS)",
                "pages": "290-303",
                "publisher": "IEEE",
                "abstract": "In mixed-criticality systems (MCSs), less-critical tasks are often terminated to ensure the correct execution of high critical tasks. This strategy could however lead to safety hazards, and largely reduce system functionality due to the absence of the discarded tasks. To overcome this problem, we introduce a high resilience and approximated computing framework for MCS, i.e., HIART-MCS. HIART-MCS introduces a novel processor which supports approximation at the hardware level. Associated with this, we also introduce a new intermediate system mode which allows less-critical tasks to be executed with reduced precision instead of being directly dropped out. Corresponding to the HIART-MCS, we further present a new theoretical model and schedulability analysis providing a timing guarantee for the system, followed by optimisations of the mode switch strategy. As demonstrated in both the theoretical and practical …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:ns9cj8rnVeAC",
            "num_citations": 12,
            "citedby_url": "/scholar?hl=en&cites=4719861805642397769",
            "cites_id": [
                "4719861805642397769"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9622396/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:Sbg_Kk5RgEEJ:scholar.google.com/",
            "cites_per_year": {
                "2022": 4,
                "2023": 2,
                "2024": 4,
                "2025": 2
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "A high-resilience imprecise computing architecture for mixed-criticality systems",
                "pub_year": 2022,
                "citation": "IEEE Transactions on Computers 72 (1), 29-42, 2022",
                "author": "Zhe Jiang and Xiaotian Dai and Alan Burns and Neil Audsley and Zonghua Gu and Ian Gray",
                "journal": "IEEE Transactions on Computers",
                "volume": "72",
                "number": "1",
                "pages": "29-42",
                "publisher": "IEEE",
                "abstract": "Conventional mixed-criticality systems (MCS)s are designed to terminate the execution of less critical tasks in exceptional situations so that the timing properties of more critical tasks can be preserved. Such a strategy can be controversial and has proven difficult to implement in practice, as it can lead to hazards and reduced functionality due to the absence of the discarded tasks. To mitigate this issue, the imprecise mixed-critically system model (IMCS) has been proposed. In such a model, instead of completely dropping less-critical tasks, these tasks are executed as much as possible through the use of decreased computation precision. Although IMCS could effectively improve the survivability of the less-critical tasks, it also introduces three key drawbacks - run-time computation errors, real-time performance degradation, and lack of flexibility. In this paper, we present a novel IMCS framework, which can (i) mitigate …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:lSLTfruPkqcC",
            "num_citations": 11,
            "citedby_url": "/scholar?hl=en&cites=13724714903226119411",
            "cites_id": [
                "13724714903226119411"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9869703/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:83RN4nz7d74J:scholar.google.com/",
            "cites_per_year": {
                "2023": 1,
                "2024": 4,
                "2025": 6
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Cache-aware allocation of parallel jobs on multi-cores based on learned recency",
                "pub_year": 2023,
                "citation": "Proceedings of the 31st International Conference on Real-Time Networks and …, 2023",
                "author": "Shuai Zhao and Xiaotian Dai and Benjamin Lesage and Iain Bate",
                "pages": "177-187",
                "abstract": " Scheduling of tasks on multi- and many-cores benefits significantly from the efficient use of caches. Most previous approaches use the static analysis of software in the context of the processing hardware to derive fixed allocations of software to the cache. However, there are many issues with this approach in terms of pessimism, scalability, analysis complexity, maintenance cost, etc. Furthermore, with ever more complex functionalities being implemented in the system, it becomes nearly impracticable to use static analysis for deriving cache-aware scheduling methods. This paper focuses on a dynamic approach to maximise the throughput of multi-core systems by benefiting from the cache based on empirical assessments. The principal contribution is a novel cache-aware allocation for parallel jobs that are organised as directed acyclic graphs (DAGs). Instead of allocating instruction and data blocks to caches, the …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:SeFeTyx0c_EC",
            "num_citations": 10,
            "citedby_url": "/scholar?hl=en&cites=13652454800343972476",
            "cites_id": [
                "13652454800343972476"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3575757.3593642",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:fDqUnk5Dd70J:scholar.google.com/",
            "cites_per_year": {
                "2023": 2,
                "2024": 3,
                "2025": 5
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Predicting worst-case execution time trends in long-lived real-time systems",
                "pub_year": 2017,
                "citation": "Ada-Europe International Conference on Reliable Software Technologies, 87-101, 2017",
                "author": "Xiaotian Dai and Alan Burns",
                "pages": "87-101",
                "publisher": "Springer International Publishing",
                "abstract": "In some long-lived real-time systems, it is not uncommon to see that the execution times of some tasks may exhibit trends. For hard and firm real-time systems, it is important to ensure these trends will not jeopardize the system. In this paper, we first introduce the notion of dynamic worst-case execution time (dWCET), which forms a new perspective that could help a system to predict potential timing failures and optimize resource allocations. We then have a comprehensive review of trend prediction methods. In the evaluation, we make a comparative study of dWCET trend prediction. Four prediction methods, combined with three data selection processes, are applied in an evaluation framework. The result shows the importance of applying data preprocessing and suggests that non-parametric estimators perform better than parametric methods."
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:MXK_kJrjxJIC",
            "num_citations": 8,
            "citedby_url": "/scholar?hl=en&cites=17204975968750987780",
            "cites_id": [
                "17204975968750987780"
            ],
            "pub_url": "https://link.springer.com/chapter/10.1007/978-3-319-60588-3_6",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:BOqI2nxaxO4J:scholar.google.com/",
            "cites_per_year": {
                "2017": 1,
                "2018": 0,
                "2019": 1,
                "2020": 1,
                "2021": 1,
                "2022": 1,
                "2023": 0,
                "2024": 1,
                "2025": 2
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Using digital twins in the development of complex dependable real-time embedded systems",
                "pub_year": 2022,
                "citation": "International Symposium on Leveraging Applications of Formal Methods, 37-53, 2022",
                "author": "Xiaotian Dai and Shuai Zhao and Benjamin Lesage and Iain Bate",
                "pages": "37-53",
                "publisher": "Springer Nature Switzerland",
                "abstract": "Modelling execution times in complex real-time embedded systems is vital for understanding and predicting tasks’ temporal behaviour, and to improve the system scheduling performance. Previous research mainly relied on worst-case execution time estimations based on formal static analyses that are often pessimistic. The models that resulted are hard to maintain and even harder to validate. In this work, the novel use of Digital Twins provides opportunities to improve this issue and beyond for dependable real-time systems. We aim to establish and contribute to three questions: (i) how to easily model execution times with an adequate level of abstraction, and how to evaluate the quality of that model; (ii) how to identify errors in the models and how to evaluate the impact of errors; and (iii) how to make decisions as to when and how to improve the models. In this paper, we proposed a Digital Twin-based adaptation …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:vV6vV6tmYwMC",
            "num_citations": 5,
            "citedby_url": "/scholar?hl=en&cites=17050397555037394106",
            "cites_id": [
                "17050397555037394106"
            ],
            "pub_url": "https://link.springer.com/chapter/10.1007/978-3-031-19762-8_4",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:ulQxSz0un-wJ:scholar.google.com/",
            "cites_per_year": {
                "2022": 1,
                "2023": 1,
                "2024": 2,
                "2025": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "dag-gen-rnd: A randomized multi-DAG task generator for scheduling and allocation research",
                "pub_year": 2022,
                "citation": "Zenodo, 2022",
                "author": "Xiaotian Dai",
                "journal": "Zenodo",
                "abstract": "dag-gen-rnd: A randomized multi-DAG task generator for scheduling and allocation research \n- ADS Now on home page ads icon ads Enable full ADS view ADS dag-gen-rnd: A \nrandomized multi-DAG task generator for scheduling and allocation research Dai, Xiaotian \nAbstract A randomized multi-DAG task generator for scheduling and allocation research. \nPublication: Zenodo Pub Date: DOI: 10.5281/zenodo.6334205 Bibcode: 2022zndo...6334205D \nKeywords: DAG generator; scheduling and allocation; real-time systems; high performance \ncomputing full text sources Zenodo | © The SAO Astrophysics Data System adshelp[at]cfa.harvard.edu \nThe ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative \nAgreement 80NSSC21M0056 Smithsonian logo Harvard Center for Astrophysics logo NASA \nlogo *The material contained in this document is based upon work supported by a National …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:4OULZ7Gr8RgC",
            "num_citations": 5,
            "citedby_url": "/scholar?hl=en&cites=12184480902398975304",
            "cites_id": [
                "12184480902398975304"
            ],
            "pub_url": "https://ui.adsabs.harvard.edu/abs/2022zndo...6334205D/abstract",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:SJ0FGNP4F6kJ:scholar.google.com/",
            "cites_per_year": {
                "2024": 4,
                "2025": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Reducing loss of service for mixed-criticality systems through cache-and stress-aware scheduling",
                "pub_year": 2023,
                "citation": "Proceedings of the 31st International Conference on Real-Time Networks and …, 2023",
                "author": "Benjamin Lesage and Xiaotian Dai and Shuai Zhao and Iain Bate",
                "pages": "188-199",
                "abstract": "Hardware resources found in modern processor architecture, such as the memory hierarchy, can improve the performance of a task by anticipating its needs based on its execution history and behaviour. Interleaved jobs, belonging to other tasks with different behaviours, can cause stress on those resources by disrupting the execution history thus slowing down more sensitive tasks. Schedulability analyses and policies tend to ignore such behaviours, in favour of conservative assumptions, as their effects are difficult to assess. When they are included, the analysis can be very complex and the measures needed are hard to obtain. In this paper, we propose abstract timing models that capture stress and sensitivity with respect to the memory hierarchy. The advantage of an abstract timing model is that it can be derived through measurements without the need for a detailed understanding of the precise cache hierarchy …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:ZHo1McVdvXMC",
            "num_citations": 4,
            "citedby_url": "/scholar?hl=en&cites=16415055500439411290",
            "cites_id": [
                "16415055500439411290"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3575757.3593654",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:WloDyAH-zeMJ:scholar.google.com/",
            "cites_per_year": {
                "2023": 1,
                "2024": 0,
                "2025": 3
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Evolvement of scheduling theories for autonomous vehicles",
                "pub_year": 2023,
                "citation": "Machine Learning and Optimization Techniques for Automotive Cyber-Physical …, 2023",
                "author": "Wanli Chang and Nan Chen and Shuai Zhao and Xiaotian Dai",
                "pages": "43-80",
                "publisher": "Springer International Publishing",
                "abstract": "The development of the automotive industry toward autonomous vehicles creates a new set of requirements for real-time scheduling, due to the rocketing complexity. To start with, while scheduling theories for simple task models and uniprocessors have been well established, multiprocessors are being deployed and dependencies between tasks need to be considered. In addition, reliability is a safety-related issue, especially when there is large-scale resource sharing. On communication, the in-vehicle backbone network is migrating to Ethernet. Eventually, scheduling/controller co-design from the cyber-physical systems (CPS) perspective is desired. In this chapter, we present three interconnected fundamental works along the above directions. First, we introduce a concurrent provider and consumer (CPC) model and a novel scheduling method that orders the nodes. Second, we present the first fault-tolerant …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:rO6llkc54NcC",
            "num_citations": 4,
            "citedby_url": "/scholar?hl=en&cites=17130650482810659849",
            "cites_id": [
                "17130650482810659849"
            ],
            "pub_url": "https://link.springer.com/chapter/10.1007/978-3-031-28016-0_2",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:CaRNH9pLvO0J:scholar.google.com/",
            "cites_per_year": {
                "2024": 2,
                "2025": 2
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Line-Circle-Square (LCS): A multilayered geometric filter for edge-based detection",
                "pub_year": 2021,
                "citation": "Robotics and Autonomous Systems, 103732, 2021",
                "author": "Seyed Amir Tafrishi and Xiaotian Dai and Vahid Esmaeilzadeh Kandjani",
                "journal": "Robotics and Autonomous Systems",
                "pages": "103732",
                "publisher": "Elsevier",
                "abstract": "This paper presents a state-of-the-art filter that reduces the complexity in object detection, tracking and mapping applications. Existing edge detection and tracking methods are proposed to create suitable autonomy for mobile robots, however, many of them face overconfidence and large computations at the entrance to scenarios with an immense number of landmarks. The method in this work, the Line–Circle–Square (LCS) filter, claims that mobile robots without a large database for object recognition and highly advanced prediction methods can deal with incoming objects that the camera captures in real-time. The proposed filter applies detection, tracking and learning to each defined expert to extract higher level information for judging scenes without over-calculation. The interactive learning feed between each expert increases the consistency of detected landmarks that works against overwhelming detected …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:qUcmZB5y_30C",
            "num_citations": 4,
            "citedby_url": "/scholar?hl=en&cites=5053510634724944474",
            "cites_id": [
                "5053510634724944474"
            ],
            "pub_url": "https://www.sciencedirect.com/science/article/pii/S0921889021000178",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:WmpwyyWtIUYJ:scholar.google.com/",
            "cites_per_year": {
                "2021": 1,
                "2022": 1,
                "2023": 1,
                "2024": 0,
                "2025": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Context-aware graceful degradation for mixed-criticality scheduling in autonomous systems",
                "pub_year": 2023,
                "citation": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and …, 2023",
                "author": "Jie Zou and Xiaotian Dai and John A McDermid",
                "journal": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
                "volume": "43",
                "number": "3",
                "pages": "788-801",
                "publisher": "IEEE",
                "abstract": "Autonomous systems are of high complexity and often regarded as mixed-criticality systems (MCSs) in which functions are allocated criticality levels according to risk assessment based on safety standards. Typically, tasks have different real-time requirements across criticality levels, and the estimated worst-case execution times (WCETs) are distinct. Further, limitations in computational resources increase the difficulty of integrating tasks onto one shared hardware platform. Conventionally, all nonsafety critical tasks must be discarded or suspended to guarantee the execution of safety-critical tasks when facing a timing fault. This typically leads to a considerable decrease in the system’s Quality-of-Service (QoS). Achieving more graceful degradation is critical to minimizing QoS reduction. This work focuses on tackling timing faults and proposes a novel graceful degradation strategy for use in a mixed-criticality context …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:zA6iFVUQeVQC",
            "num_citations": 3,
            "citedby_url": "/scholar?hl=en&cites=9736170726918576884",
            "cites_id": [
                "9736170726918576884"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/10310275/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:9NqJErHTHYcJ:scholar.google.com/",
            "cites_per_year": {
                "2024": 1,
                "2025": 2
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "NPRC-I/O: An NoC-Based Real-Time I/O System With Reduced Contention and Enhanced Predictability",
                "pub_year": 2023,
                "citation": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and …, 2023",
                "author": "Zhe Jiang and Xiaotian Dai and Ran Wei and Ian Gray and Zonghua Gu and Qingling Zhao and Shuai Zhao",
                "journal": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
                "volume": "42",
                "number": "12",
                "pages": "4629-4642",
                "publisher": "IEEE",
                "abstract": "All systems rely on inputs and outputs (I/Os) to perceive and interact with their surroundings. In safety-critical systems, it is important to guarantee both the performance and time-predictability of I/O operations. However, with the continued growth of architectural complexity in modern safety-critical systems, satisfying such real-time requirements has become increasingly challenging due to complex I/O transaction paths and extensive hardware contention. In this article, we present a new Network-on-Chip (NoC)-based Predictable I/O system framework (NPRC-I/O) which reduces this contention and ensures the performance and time-predictability of I/O operations. Specifically, NPRC-I/O contains a programmable I/O command controller (NPRC-CC) and a run-time reconfigurable NoC ( NoC), which provides the capability to adjust I/O transaction paths at run time. Using this flexibility, we construct an end-to-end …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:3s1wT3WcHBgC",
            "num_citations": 3,
            "citedby_url": "/scholar?hl=en&cites=11826417731955430604",
            "cites_id": [
                "11826417731955430604"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/10168011/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:zJSVpkTgH6QJ:scholar.google.com/",
            "cites_per_year": {
                "2024": 3
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Graceful Degradation with Condition-and Inference-Awareness for Mixed-Criticality Scheduling in Autonomous Systems",
                "pub_year": 2023,
                "citation": "Proceedings of Cyber-Physical Systems and Internet of Things Week 2023, 215-220, 2023",
                "author": "Jie Zou and Xiaotian Dai and John Mcdermid",
                "pages": "215-220",
                "abstract": "In an autonomous system, understanding functional causality is crucial when designing a shared resource scheduling strategy. Without this, the system would be unlikely to achieve a holistic functional quality of service (QoS) and may not meet safety goals. This work proposes a novel graceful degradation strategy in a mixed-criticality context. Instead of discarding computational load at the application level, a qualitative and quantitative definition of importance order is used to assist in realizing finer-grained task-level degradation and preserve more LO-criticality tasks. The causality analysis-based degradation bridges the gap where functional dependencies are not considered in the scheduling design and, thus, leads to the system being able to continue to run with relatively high QoS during the degradation process. "
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:HoB7MX3m0LUC",
            "num_citations": 3,
            "citedby_url": "/scholar?hl=en&cites=15900484219691291145",
            "cites_id": [
                "15900484219691291145"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3576914.3587511",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:CVJnRyfeqdwJ:scholar.google.com/",
            "cites_per_year": {
                "2023": 1,
                "2024": 0,
                "2025": 2
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Many-core real-time network-on-chip I/O systems for reducing contention and enhancing predictability",
                "pub_year": 2023,
                "citation": "Proceedings of Cyber-Physical Systems and Internet of Things Week 2023, 227-233, 2023",
                "author": "Zhe Jiang and Xiaotian Dai and Shuai Zhao and Ran Wei and Ian Gray",
                "pages": "227-233",
                "abstract": " In safety-critical and high-integrity computing, it is important to guarantee both performance and time-predictability of I/O operations. However, with the continued growth of hardware and architectural complexity, satisfying such real-time requirements has become increasingly challenging because of complex I/O transaction paths and extensive hardware contention. This paper proposes a systematic framework with a novel I/O controller and a reconfigurable NoC, effectively optimising I/O transaction paths to encounter reduced contention. Moreover, we present a theoretical model and optimisation process to further improve real-time performance. The evaluations show that our approach outperforms state-of-the-art I/O processing techniques on a range of metrics. "
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:pqnbT2bcN3wC",
            "num_citations": 3,
            "citedby_url": "/scholar?hl=en&cites=10059369527529907447",
            "cites_id": [
                "10059369527529907447"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3576914.3587514",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:9yTP2EkPmosJ:scholar.google.com/",
            "cites_per_year": {
                "2024": 3
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Resilience-Aware Mixed-Criticality DAG Scheduling on Multi-cores for Autonomous Systems",
                "pub_year": 2022,
                "citation": "ACM SIGAda Ada Letters 42 (1), 81-85, 2022",
                "author": "Jie Zou and Xiaotian Dai and John A McDermid",
                "journal": "ACM SIGAda Ada Letters",
                "volume": "42",
                "number": "1",
                "pages": "81-85",
                "publisher": "ACM",
                "abstract": "Fully- and semi-autonomous systems are complex and safety-critical with strict timing and resource constraints, and have a deep processing pipeline with strong dependencies between different functions. Furthermore, tasks with different criticalities share the same hardware, and the scheduling strategy has to guarantee high criticality tasks' execution irrespective of interference from low criticality tasks whilst respecting the precedence constraints among tasks. Most static scheduling work considering task dependencies does not take into account the survivability of low criticality tasks, instead assuming that all low criticality tasks should be suspended or discarded after a mode change. Consequently, the schedules for high and low modes are different, so that more effort is needed to check the safety of schedules during mode change and with a potential increase in the migration cost as tasks may be executed on a …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:70eg2SAEIzsC",
            "num_citations": 2,
            "citedby_url": "/scholar?hl=en&cites=2201555895810433937",
            "cites_id": [
                "2201555895810433937"
            ],
            "pub_url": "https://dl.acm.org/doi/abs/10.1145/3577949.3577965",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:kaPyQmx_jR4J:scholar.google.com/",
            "cites_per_year": {
                "2024": 2
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Brief industry paper: Digital twin for dependable multi-core real-time systems—requirements and open challenges",
                "pub_year": 2021,
                "citation": "2021 IEEE 27th Real-Time and Embedded Technology and Applications Symposium …, 2021",
                "author": "Xiaotian Dai and Shuai Zhao and Iain Bate and Alan Burns and Xing Guo and Wanli Chang",
                "conference": "2021 IEEE 27th Real-Time and Embedded Technology and Applications Symposium (RTAS)",
                "pages": "481-484",
                "publisher": "IEEE",
                "abstract": "Development of dependable multi-/many-core systems requires assurance that the system is operable in a range of conditions, subjected to both functional and non-functional requirements. To achieve this, tools need to be implemented that can enable exploration of design options and be able to detect deficiencies earlier to avoid costly system re-design. In this work we discuss the challenges of design of multi-core realtime systems with timing assurance and discuss what are the requirements for modelling, testing and analysis tools. Digital Twin-based predictive modelling and fast design space evaluation are studied that work toward addressing these challenges."
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:NMxIlDl6LWMC",
            "num_citations": 2,
            "citedby_url": "/scholar?hl=en&cites=3899504636693976243",
            "cites_id": [
                "3899504636693976243"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9470437/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:sxQifs7SHTYJ:scholar.google.com/",
            "cites_per_year": {
                "2021": 1,
                "2022": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Flexible and Adaptive Real-Time Task Scheduling in Cyber-Physical Control Systems",
                "pub_year": 2019,
                "citation": "University of York, 2019",
                "author": "Xiaotian Dai",
                "abstract": "In a Cyber-Physical Control System (CPCS), there is often a hybrid of hard real-time tasks which have stringent timing requirements and soft real-time tasks that are computationally intensive. The task scheduling of such systems is challenging and requires flexible schemes that can meet the timing requirements without being over-conservative.  Fixed-priority scheduling (FPS) is a scheduling policy that has been widely used in industry. However, as an open-loop scheduler, FPS has low system dynamics and no feedback from historic operation. As the working conditions of a CPCS will change due to both internal and external factors, an improved scheduling scheme is required which can adapt to changes without a costly system redesign.  In recent years, there is a large research interest in the co-design of control and scheduling systems that explicitly considers task scheduling during the design of a controller. Many of these works reveal the possibility of adapting control periods at run-time in order to accommodate varying resource requirements and to optimise CPU utilization. It is also shown that control quality can be traded off for resource usages.  In this thesis, an adaptive real-time scheduling framework for CPCS is presented. The adaptive scheduler has a hierarchical structure and it is built on top of a traditional FPS scheduler. The idea of dynamic worst-case execution time is introduced and its cause and methods to identify the existence of a trend are discussed. An adaptation method that uses monitored statistical information to update control task periods is then introduced. Finally, this method is extended by proposing a dual-period …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:4TOpqqG69KYC",
            "num_citations": 2,
            "citedby_url": "/scholar?hl=en&cites=15237308781168648802",
            "cites_id": [
                "15237308781168648802"
            ],
            "pub_url": "https://etheses.whiterose.ac.uk/id/eprint/23950/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:YmJ_EpvLddMJ:scholar.google.com/",
            "cites_per_year": {
                "2020": 1,
                "2021": 0,
                "2022": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Discretization and stabilization of energy-based controller for period switching control and flexible scheduling",
                "pub_year": 2022,
                "citation": "2022 American Control Conference (ACC), 844-849, 2022",
                "author": "Seyed Amir Tafrishi and Xiaotian Dai and Yasuhisa Hirata and Alan Burns",
                "conference": "2022 American Control Conference (ACC)",
                "pages": "844-849",
                "publisher": "IEEE",
                "abstract": "Emerging advanced control applications, with increased complexity in software but limited computing resources, suggest that real-time controllers should have adaptable designs. These control strategies also should be designed with consideration of the run-time behavior of the system. One of such research attempts is to design the controller along with the task scheduler, known as control-scheduling co-design, for more predictable timing behavior as well as surviving system overloads. Unlike traditional controller designs, which have equal-distance sampling periods, the co-design approach increases the system flexibility and resilience by explicitly considering timing properties, for example using an event-based controller or with multiple sampling times (non-uniform sampling and control). Within this context, we introduce the first work on the discretization of an energy-based controller that can switch arbitrarily …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:2P1L_qKh6hAC",
            "num_citations": 1,
            "citedby_url": "/scholar?hl=en&cites=13818078347042847416",
            "cites_id": [
                "13818078347042847416"
            ],
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/9867252/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:uHoBmgutw78J:scholar.google.com/",
            "cites_per_year": {
                "2024": 1
            }
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "LEFT-RS: A Lock-Free Fault-Tolerant Resource Sharing Protocol for Multicore Real-Time Systems",
                "pub_year": 2025,
                "citation": "RTSS 2025: proceedings, 2025",
                "author": "Nan Chen and STEVEN XIAOTIAN DAI and Tong Cheng and ALAN BURNS and IAIN JOHN BATE and SHUAI ZHAO",
                "conference": "RTSS 2025: proceedings",
                "publisher": "IEEE",
                "abstract": "Emerging real-time applications have driven the transition to multicore embedded systems, where tasks must share resources due to functional demands and limited availability. These resources, whether local or global, are protected within critical sections to prevent race conditions, with locking protocols ensuring both exclusive access and timing requirements. However, transient faults occurring within critical sections can disrupt execution and propagate errors across multiple tasks. Conventional locking protocols fail to address such faults, and integrating traditional fault tolerance techniques often increases blocking. Recent approaches improve fault recovery through parallel replica execution; however, challenges remain due to sequential accessing, coordination overhead, and susceptibility to common-mode faults. In this paper, we propose a Lock-frEe Fault-Tolerant Resource Sharing (LEFT-RS) protocol for multicore real-time systems. LEFT-RS allows tasks to concurrently access and read global resources while entering their critical sections in parallel. Each task can complete its access earlier upon successful execution if other tasks experience faults, thereby improving the efficiency of resource usage. Our design also limits the overhead and enhances fault resilience. We present a comprehensive worst-case response time analysis to ensure timing guarantees. Extensive evaluation results demonstrate that our method significantly outperforms existing approaches, achieving up to an 84.5% improvement in schedulability on average."
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:cFHS6HbyZ2cC",
            "num_citations": 0,
            "pub_url": "https://eprints.whiterose.ac.uk/id/eprint/232452/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:pb4uMbJJfhsJ:scholar.google.com/",
            "cites_per_year": {}
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "A Hybrid Approach to Refine WCRT Bounds for DAG Scheduling Using Anomaly Classification",
                "pub_year": 2025,
                "citation": "IEEE Transactions on Computers, 2025",
                "author": "Nan Chen and Xiaotian Dai and Alan Burns and Iain Bate",
                "journal": "IEEE Transactions on Computers",
                "publisher": "IEEE",
                "abstract": "Motivated by the performance demands and stringent timing requirements of safety-critical systems like avionics and autonomous vehicles, research has focused on providing timing guarantees for the scheduling of Directed Acyclic Graph (DAG) tasks in multicore systems. The structural complexity and timing anomalies make this problem challenging. Existing methods bound the Worst-Case Response Time (WCRT) of tasks through static analysis, but these bounds are complicated, difficult to validate, and often remain pessimistic for many scheduling scenarios. Runtime enforcement of scheduling constraints can be effective in eliminating timing anomalies and providing timing guarantees; however, it is unnecessary for anomaly-free scheduling scenarios, leading to non-work-conserving schedules and deliberate utilization loss. This paper proposes a hybrid approach to identify timing anomalies in DAG scheduling …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:dfsIfKJdRG4C",
            "num_citations": 0,
            "pub_url": "https://ieeexplore.ieee.org/abstract/document/11152392/",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:0UA30kGryigJ:scholar.google.com/",
            "cites_per_year": {}
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "A cache-aware DAG scheduling method on multicores: Exploiting node affinity and deferred executions",
                "pub_year": 2025,
                "citation": "Journal of systems architecture 161, 103372, 2025",
                "author": "Huixuan Yi and Yuanhai Zhang and Zhiyang Lin and Haoran Chen and Yiyang Gao and Xiaotian Dai and Shuai Zhao",
                "journal": "Journal of systems architecture",
                "volume": "161",
                "pages": "103372",
                "publisher": "North-Holland",
                "abstract": "With increasingly complex functionalities being implemented in emerging applications, multicores are widely adopted with a layered cache hierarchy, and Directed Acyclic Graphs (DAGs) are commonly employed to model the execution dependencies between tasks. For such systems, scheduling methods can be designed to effectively leverage the cache to accelerate the system execution. However, the traditional methods either do not consider DAGs, or rely on sophisticated static analysis to produce fixed scheduling solutions that require additional hardware support (e.g., cache partitioning and colouring), which undermines both the applicability and flexibility of these methods. Recently, an online cache-aware DAG scheduling method has been presented that schedules DAGs using an execution time model with caching effects considered, eliminating the need for static analysis and additional hardware support …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:fPk4N6BV_jEC",
            "num_citations": 0,
            "pub_url": "https://www.sciencedirect.com/science/article/pii/S138376212500044X",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:ELQH7VmI4BUJ:scholar.google.com/",
            "cites_per_year": {}
        },
        {
            "container_type": "Publication",
            "source": "AUTHOR_PUBLICATION_ENTRY",
            "bib": {
                "title": "Special edition on resource partitioning for modern multicore systems",
                "pub_year": 2024,
                "citation": "Real-Time Systems 60 (3), 367-368, 2024",
                "author": "Ian Gray and Xiaotian Dai",
                "journal": "Real-Time Systems",
                "volume": "60",
                "number": "3",
                "pages": "367-368",
                "publisher": "Springer US",
                "abstract": "This special edition collects significant recent results around the problem of how to allocate hardware and software resources to the kinds of complex multicore systems that are now entering the market. This is of particular timely importance because safety–critical and timing-aware systems have increasingly complex software requirements, and yet the hardware platforms to support them are becoming more opaque and hard to analyse. Where once it was possible to simply dedicate specific hardware resources to timing-critical components, the increasing density of such components combined with their expanded resource requirements mean that this is no longer feasible. Contemporary systems must share multicore computing and communications resources between the tasks of the system, in a way which can predictably support the timing behaviour of the system. While resource partitioning is a long-established …"
            },
            "filled": true,
            "author_pub_id": "G7dzNUkAAAAJ:u_35RYKgDlwC",
            "num_citations": 0,
            "pub_url": "https://link.springer.com/article/10.1007/s11241-024-09428-2",
            "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:rlTQHV5lC_kJ:scholar.google.com/",
            "cites_per_year": {}
        }
    ],
    "citedby5y": 524,
    "hindex": 12,
    "hindex5y": 12,
    "i10index": 14,
    "i10index5y": 14,
    "cites_per_year": {
        "2019": 10,
        "2020": 38,
        "2021": 64,
        "2022": 77,
        "2023": 90,
        "2024": 141,
        "2025": 110
    }
}